"""
서울시 범죄 현황 분석
"""
import numpy as np
import pandas as pd
import googlemaps
from sklearn import preprocessing
import matplotlib.pyplot as plt
import seaborn as sns
import folium

crime_anal_police = pd.read_csv('C:\\Users\\Administrator\\source\\repos\\Seoul_CCTV\\crime_in_Seoul.csv', thousands=',', encoding='euc-kr')                                                        

crime_anal_police.head()

gmaps_key = ""

gmaps = googlemaps.Client(key = gmaps_key)

gmaps.geocode('서울중부경찰서', language='ko')

"""
[{'address_components': [{'long_name': '２７', 'short_name': '２７', 'types': ['premise']}, {'long_name': '수표로', 'short_name': '수표로', 'types': ['political', 'sublocality', 'sublocality_level_4']}, {'long_name': '을지로동', 'short_name': '을지로동', 'types': ['political', 'sublocality', 'sublocality_level_2']}, {'long_name': '중구', 'short_name': '중구', 'types': ['political', 'sublocality', 'sublocality_level_1']}, {'long_name': '서울특별시', 'short_name': '서울특별시', 'types': ['administrative_area_level_1', 'political']}, {'long_name': '대한민국', 'short_name': 'KR', 'types': ['country', 'political']}, {'long_name': '100-032', 'short_name': '100-032', 'types': ['postal_code']}], 'formatted_address': '대한민국 서울특별시 중구 을지로동 수표로 27', 'geometry': {'location': {'lat': 37.5636465, 'lng': 126.9895796}, 'location_type': 'ROOFTOP', 'viewport': {'northeast': {'lat': 37.56499548029149, 'lng': 126.9909285802915}, 'southwest': {'lat': 37.56229751970849, 'lng': 126.9882306197085}}}, 'place_id': 'ChIJc-9q5uSifDURLhQmr5wkXmc', 'plus_code': {'compound_code': 'HX7Q+FR 대한민국 서울특별시', 'global_code': '8Q98HX7Q+FR'}, 'types': ['establishment', 'point_of_interest', 'police']}]
"""

# formatted_address
# lng 위도
# lat 경도

station_name = []

for name in crime_anal_police['관서명']:
    station_name.append('서울'+str(name[:-1])+'경찰서')
station_name
station_address = []
station_lat = []
station_lng = []
for name in station_name:
    tmp = gmaps.geocode(name, language='ko')
    station_address.append(tmp[0].get('formatted_address'))

    tmp_loc = tmp[0].get('geometry')
    station_lat.append(tmp_loc['location']['lat'])
    station_lng.append(tmp_loc['location']['lng'])
    print(name + '----->'+tmp[0].get('formatted_address'))
station_lat
station_lng

gu_name = []
## 2차 코딩

for name in station_address:
    tmp = name.split()

    tmp_gu = [gu for gu in tmp if gu[-1] == '구'][0]
    print('****'+ tmp_gu)
    gu_name.append(tmp_gu)
gu_name

type(crime_anal_police)  # pandas.core.frame.DataFrame
len(crime_anal_police['관서명'])  # 31
type(gu_name) # 'list'
len(gu_name) # 31
crime_anal_police['구별'] = gu_name
crime_anal_police.head()

# 금천경찰서는 관악구 위치에 있어서 금천서는 예외 처리

crime_anal_police[crime_anal_police['관서명']=='금천서']

crime_anal_police.loc[crime_anal_police['관서명']=='금천서',['구별']] = '금천구'
# 금천서를 찾아서 
crime_anal_police[crime_anal_police['관서명']=='금천서']
# 관악구로 되어 있는 것을 금천구로 바꿔라
crime_anal_police

# 중간에 에러가 나서 계속 데이터를 제작하는 것을 방지하기 위해
# 2번 데이터로 저장

crime_anal_police.to_csv('C:\\Users\\Administrator\\source\\repos\\Seoul_CCTV\\crime_anal_police2.csv')
crime_anal_police2 = pd.read_csv('C:\\Users\\Administrator\\source\\repos\\Seoul_CCTV\\crime_anal_police2.csv')
crime_anal_police2

# 관서별로 되어 있는 것을 구별로 바꾸는 작업

crime_anal_police3 = pd.pivot_table(crime_anal_police2, index='구별', aggfunc = np.sum)

crime_anal_police3.head()

police = crime_anal_police3

police['강간검거율'] = police['강간 검거'] / police['강간 발생'] * 100
police['강도검거율'] = police['강도 검거'] / police['강도 발생'] * 100
police['절도검거율'] = police['절도 검거'] / police['절도 발생'] * 100
police['살인검거율'] = police['살인 검거'] / police['살인 발생'] * 100
police['폭력검거율'] = police['폭력 검거'] / police['폭력 발생'] * 100

del police['강간 검거']
del police['강도 검거']
del police['절도 검거']
del police['살인 검거']
del police['폭력 검거']

con_list = ['강간검거율','강도검거율','절도검거율','살인검거율','폭력검거율']
con_list
for i in con_list:
    police.loc[police[i] > 100, i] = 100  
police.head()
    
    # 검거율이 100 이 넘는 값이 보임. 1년이상의 기간이 포함된 데이터 오류
    # 비율이 100 을 넘을 수 없으니 100 오버는 그냥 100으로 처리

police.rename(columns = {'강간 발생':'강간',
                                    '강도 발생':'강도',
                                    '절도 발생':'절도',
                                    '살인 발생':'살인',
                                    '폭력 발생':'폭력',

}, inplace = True)

# 숫자값으로 모델링화

col = ['강간','강도','절도','살인','폭력']

x = police[col].values
min_max_scalar = preprocessing.MinMaxScaler()
"""
스케일링은 자료 집합에 적용되는 전처리 과정으로 모든 자료에
선형 변환을 적용하여 전체 자료의 분포를 
평균 0, 분산 1이 되도록 만드는 과정이다.
"""
x_scaled = min_max_scalar.fit_transform(x.astype(float))
# min_max_scale(X): 최대/최소값이 각각 1, 0이 되도록 스케일링
police_norm = pd.DataFrame(x_scaled, columns=col, index = police.index)
# 각 컬럼별로 정규화 하기

col2 =  ['강간검거율','강도검거율','절도검거율','살인검거율','폭력검거율']
police_norm[col2] = police[col2]
police_norm.head()

"""
           강간        강도        절도    ...          절도검거율       살인검거율      폭력검거율
구별                                   ...                                      
강남구  1.000000  0.941176  0.953472    ...      42.857143   76.923077  86.484594
강동구  0.155620  0.058824  0.445775    ...      33.347422   75.000000  82.890855
강북구  0.146974  0.529412  0.126924    ...      43.096234  100.000000  88.637222
관악구  0.628242  0.411765  0.562094    ...      30.561715   88.888889  80.109157
광진구  0.397695  0.529412  0.671570    ...      42.200925  100.000000  83.047619
"""
# 발생건수를 정규화 시켰다
# 두개의 csv 파일을 합치는 과정
context = "C:/Users/Administrator/source/repos/Seoul_CCTV/"
data_result = pd.read_csv(context+"data_result.csv", index_col="구별")
police_norm['범죄'] = np.sum(police_norm[col], axis = 1)
police_norm.head()

police_norm['검거'] = np.sum(police_norm[col2], axis = 1)
police_norm.head()
police_norm[['인구수','CCTV']] = data_result[['인구수','소계']]

# ****************
# 데이터 시각화 하기
# ****************

import matplotlib.pyplot as plt
import seaborn as sns
import platform
path = 'C:/Windows/Fonts/malgun.ttf'
from matplotlib import font_manager, rc

font_name = font_manager.FontProperties(fname=path).get_name()
rc('font', family = font_name)

sns.pairplot(police_norm, 
             vars = ['강도','살인','폭력'],
             kind = 'reg',
             size = 3)

plt.show()

# 강도와 폭력, 살인과 폭력, 강도와 살인 모두 양의  상관관계가 보입니다.
police_norm.columns
sns.pairplot(police_norm, 
             x_vars = ['인구수','CCTV'],
             y_vars = ['살인','강도'],
             kind = 'reg',
             size = 3)

plt.show()
# 인구수와 CCTV 갯수, 그리고 살인과 강도에 대한 상관관계 분석
# 전체적인 상관계수는 CCTV 와 살인의 관계가 낮다
# 단, CCTV 가 없을 때 살인이 많이 일어나는 구간이 있습니다.
# 즉 CCTV 개수를 기준으로 좌측면에 살인과 강도의 높은 수를
# 갖는 데이터가 보인다

sns.pairplot(police_norm, 
             x_vars = ['인구수','CCTV'],
             y_vars = ['살인검거율','폭력검거율'],
             kind = 'reg',
             size = 3)

plt.show()

# 인구수와 CCTV 와 검거율간의 관계가 음의 관계이거나
# 별다른 관계가 없는 것으로 파악된다.




{"type":"FeatureCollection","features":[
{"type":"Feature", "id":"강동구", "properties":{"code":"11250","name":"강동구","name_eng":"Gangdong-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.11519584981606,37.557533180704915],[127.16683184366129,37.57672487388627],[127.18408792330152,37.55814280369575],[127.16530984307447,37.54221851258693],[127.14672806823502,37.51415680680291],[127.12123165719615,37.52528270089],[127.1116764203608,37.540669955324965],[127.11519584981606,37.557533180704915]]]}},
{"type":"Feature", "id":"송파구", "properties":{"code":"11240","name":"송파구","name_eng":"Songpa-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.0690698130372,37.522279423505026],[127.10087519791962,37.524841220167055],[127.1116764203608,37.540669955324965],[127.12123165719615,37.52528270089],[127.14672806823502,37.51415680680291],[127.1634944215765,37.497445406097484],[127.14206058413274,37.47089819098501],[127.12440571080893,37.46240445587048],[127.11117085201238,37.485708381512445],[127.0719146000724,37.50224013587669],[127.0690698130372,37.522279423505026]]]}},
{"type":"Feature", "id":"강남구", "properties":{"code":"11230","name":"강남구","name_eng":"Gangnam-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.05867359288398,37.52629974922568],[127.0690698130372,37.522279423505026],[127.0719146000724,37.50224013587669],[127.11117085201238,37.485708381512445],[127.12440571080893,37.46240445587048],[127.09842759318751,37.45862253857461],[127.08640440578156,37.472697935184655],[127.0559170481904,37.4659228914077],[127.03621915098798,37.48175802427603],[127.01397119667513,37.52503988289669],[127.02302831890559,37.53231899582663],[127.05867359288398,37.52629974922568]]]}},
{"type":"Feature", "id":"서초구", "properties":{"code":"11220","name":"서초구","name_eng":"Seocho-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.01397119667513,37.52503988289669],[127.03621915098798,37.48175802427603],[127.0559170481904,37.4659228914077],[127.08640440578156,37.472697935184655],[127.09842759318751,37.45862253857461],[127.09046928565951,37.44296826114185],[127.06778107605433,37.426197424057314],[127.04957232987142,37.42805836845694],[127.03881782597922,37.45382039851715],[126.99072073195462,37.455326143310025],[126.98367668291802,37.473856492692086],[126.98223807916081,37.509314966770326],[127.01397119667513,37.52503988289669]]]}},
{"type":"Feature", "id":"관악구", "properties":{"code":"11210","name":"관악구","name_eng":"Gwanak-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.98367668291802,37.473856492692086],[126.99072073195462,37.455326143310025],[126.96520439085143,37.438249784006246],[126.95000001010182,37.43613451165719],[126.93084408056525,37.447382928333994],[126.9167728146601,37.45490566423789],[126.90156094129895,37.47753842789901],[126.90531975801812,37.48218087575429],[126.94922661389508,37.49125437495649],[126.9725891850662,37.472561363278125],[126.98367668291802,37.473856492692086]]]}},
{"type":"Feature", "id":"동작구", "properties":{"code":"11200","name":"동작구","name_eng":"Dongjak-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.98223807916081,37.509314966770326],[126.98367668291802,37.473856492692086],[126.9725891850662,37.472561363278125],[126.94922661389508,37.49125437495649],[126.90531975801812,37.48218087575429],[126.92177893174825,37.494889877415176],[126.92810628828279,37.51329595732015],[126.95249990298159,37.51722500741813],[126.98223807916081,37.509314966770326]]]}},
{"type":"Feature", "id":"영등포구", "properties":{"code":"11190","name":"영등포구","name_eng":"Yeongdeungpo-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.89184663862764,37.547373974997114],[126.94566733083212,37.526617542453366],[126.95249990298159,37.51722500741813],[126.92810628828279,37.51329595732015],[126.92177893174825,37.494889877415176],[126.90531975801812,37.48218087575429],[126.89594776782485,37.504675281309176],[126.88156402353862,37.513970034765684],[126.88825757860099,37.54079733630232],[126.89184663862764,37.547373974997114]]]}},
{"type":"Feature", "id":"금천구", "properties":{"code":"11180","name":"금천구","name_eng":"Geumcheon-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.90156094129895,37.47753842789901],[126.9167728146601,37.45490566423789],[126.93084408056525,37.447382928333994],[126.9025831711697,37.434549366349124],[126.87683271502428,37.482576591607305],[126.90156094129895,37.47753842789901]]]}},
{"type":"Feature", "id":"구로구", "properties":{"code":"11170","name":"구로구","name_eng":"Guro-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.82688081517314,37.50548972232896],[126.88156402353862,37.513970034765684],[126.89594776782485,37.504675281309176],[126.90531975801812,37.48218087575429],[126.90156094129895,37.47753842789901],[126.87683271502428,37.482576591607305],[126.84762676054953,37.47146723936323],[126.83549485076196,37.474098236975095],[126.82264796791348,37.4878476492147],[126.82504736331406,37.50302612640443],[126.82688081517314,37.50548972232896]]]}},
{"type":"Feature", "id":"강서구", "properties":{"code":"11160","name":"강서구","name_eng":"Gangseo-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.79575768552907,37.57881087633202],[126.80702115023597,37.60123001013228],[126.82251438477105,37.5880430810082],[126.85984199399667,37.571847855292745],[126.89184663862764,37.547373974997114],[126.88825757860099,37.54079733630232],[126.86637464321238,37.54859191094823],[126.86610073476395,37.52699964144669],[126.84257291943153,37.52373707805596],[126.8242331426722,37.53788078753248],[126.77324417717703,37.5459123450554],[126.76979180579352,37.55139183008809],[126.79575768552907,37.57881087633202]]]}},
{"type":"Feature", "id":"양천구", "properties":{"code":"11150","name":"양천구","name_eng":"Yangcheon-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.8242331426722,37.53788078753248],[126.84257291943153,37.52373707805596],[126.86610073476395,37.52699964144669],[126.86637464321238,37.54859191094823],[126.88825757860099,37.54079733630232],[126.88156402353862,37.513970034765684],[126.82688081517314,37.50548972232896],[126.8242331426722,37.53788078753248]]]}},
{"type":"Feature", "id":"마포구", "properties":{"code":"11140","name":"마포구","name_eng":"Mapo-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.90522065831053,37.57409700522574],[126.93898161798973,37.552310003728124],[126.96358226710812,37.55605635475154],[126.96448570553055,37.548705692021635],[126.94566733083212,37.526617542453366],[126.89184663862764,37.547373974997114],[126.85984199399667,37.571847855292745],[126.88433284773288,37.588143322880526],[126.90522065831053,37.57409700522574]]]}},
{"type":"Feature", "id":"서대문구", "properties":{"code":"11130","name":"서대문구","name_eng":"Seodaemun-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.9524752030572,37.60508692737045],[126.95565425846463,37.576080790881456],[126.96873633279075,37.56313604690827],[126.96358226710812,37.55605635475154],[126.93898161798973,37.552310003728124],[126.90522065831053,37.57409700522574],[126.9524752030572,37.60508692737045]]]}},
{"type":"Feature", "id":"은평구", "properties":{"code":"11120","name":"은평구","name_eng":"Eunpyeong-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.9738864128702,37.62949634786888],[126.95427017006129,37.622033431339425],[126.9524752030572,37.60508692737045],[126.90522065831053,37.57409700522574],[126.88433284773288,37.588143322880526],[126.90396681003595,37.59227403419942],[126.90303066177668,37.609977911401344],[126.91455481429648,37.64150050996935],[126.956473797387,37.652480737339445],[126.9738864128702,37.62949634786888]]]}},
{"type":"Feature", "id":"노원구", "properties":{"code":"11110","name":"노원구","name_eng":"Nowon-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.0838752703195,37.69359534202034],[127.09706391309695,37.686383719372294],[127.09440766298717,37.64713490473045],[127.11326795855199,37.639622905315925],[127.10782277688129,37.61804244241069],[127.07351243825278,37.61283660342313],[127.05209373568619,37.62164065487782],[127.04358800895609,37.62848931298715],[127.05800075220091,37.64318263878276],[127.05288479710485,37.68423857084347],[127.0838752703195,37.69359534202034]]]}},
{"type":"Feature", "id":"도봉구", "properties":{"code":"11100","name":"도봉구","name_eng":"Dobong-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.05288479710485,37.68423857084347],[127.05800075220091,37.64318263878276],[127.04358800895609,37.62848931298715],[127.01465935892466,37.64943687496812],[127.02062116141389,37.667173575971205],[127.01039666042071,37.681894589603594],[127.01795099203432,37.69824412775662],[127.05288479710485,37.68423857084347]]]}},
{"type":"Feature", "id":"강북구", "properties":{"code":"11090","name":"강북구","name_eng":"Gangbuk-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.99383903424,37.676681761199085],[127.01039666042071,37.681894589603594],[127.02062116141389,37.667173575971205],[127.01465935892466,37.64943687496812],[127.04358800895609,37.62848931298715],[127.05209373568619,37.62164065487782],[127.03892400992301,37.609715611023816],[127.0128154749523,37.613652243470256],[126.98672705513869,37.63377641288196],[126.9817452676551,37.65209769387776],[126.99383903424,37.676681761199085]]]}},
{"type":"Feature", "id":"성북구", "properties":{"code":"11080","name":"성북구","name_eng":"Seongbuk-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.977175406416,37.62859715400388],[126.98672705513869,37.63377641288196],[127.0128154749523,37.613652243470256],[127.03892400992301,37.609715611023816],[127.05209373568619,37.62164065487782],[127.07351243825278,37.61283660342313],[127.07382707099227,37.60401928986419],[127.042705222094,37.59239437593391],[127.02527254528003,37.57524616245249],[126.99348293358314,37.588565457216156],[126.98879865992384,37.6118927319756],[126.977175406416,37.62859715400388]]]}},
{"type":"Feature", "id":"중랑구", "properties":{"code":"11070","name":"중랑구","name_eng":"Jungnang-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.07351243825278,37.61283660342313],[127.10782277688129,37.61804244241069],[127.1201246020114,37.60178457598188],[127.10304174249214,37.57076342290955],[127.08068541280403,37.56906425519017],[127.07382707099227,37.60401928986419],[127.07351243825278,37.61283660342313]]]}},
{"type":"Feature", "id":"동대문구", "properties":{"code":"11060","name":"동대문구","name_eng":"Dongdaemun-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.02527254528003,37.57524616245249],[127.042705222094,37.59239437593391],[127.07382707099227,37.60401928986419],[127.08068541280403,37.56906425519017],[127.07421053024362,37.55724769712085],[127.05005601081567,37.567577612590846],[127.02547266349976,37.568943552237734],[127.02527254528003,37.57524616245249]]]}},
{"type":"Feature", "id":"광진구", "properties":{"code":"11050","name":"광진구","name_eng":"Gwangjin-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.08068541280403,37.56906425519017],[127.10304174249214,37.57076342290955],[127.11519584981606,37.557533180704915],[127.1116764203608,37.540669955324965],[127.10087519791962,37.524841220167055],[127.0690698130372,37.522279423505026],[127.05867359288398,37.52629974922568],[127.07421053024362,37.55724769712085],[127.08068541280403,37.56906425519017]]]}},
{"type":"Feature", "id":"성동구", "properties":{"code":"11040","name":"성동구","name_eng":"Seongdong-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.02547266349976,37.568943552237734],[127.05005601081567,37.567577612590846],[127.07421053024362,37.55724769712085],[127.05867359288398,37.52629974922568],[127.02302831890559,37.53231899582663],[127.01070894177482,37.54118048964762],[127.02547266349976,37.568943552237734]]]}},
{"type":"Feature", "id":"용산구", "properties":{"code":"11030","name":"용산구","name_eng":"Yongsan-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.01070894177482,37.54118048964762],[127.02302831890559,37.53231899582663],[127.01397119667513,37.52503988289669],[126.98223807916081,37.509314966770326],[126.95249990298159,37.51722500741813],[126.94566733083212,37.526617542453366],[126.96448570553055,37.548705692021635],[126.98752996903328,37.55094818807139],[127.01070894177482,37.54118048964762]]]}},
{"type":"Feature", "id":"중구", "properties":{"code":"11020","name":"중구","name_eng":"Jung-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[127.02547266349976,37.568943552237734],[127.01070894177482,37.54118048964762],[126.98752996903328,37.55094818807139],[126.96448570553055,37.548705692021635],[126.96358226710812,37.55605635475154],[126.96873633279075,37.56313604690827],[127.02547266349976,37.568943552237734]]]}},
{"type":"Feature", "id":"종로구", "properties":{"code":"11010","name":"종로구","name_eng":"Jongno-gu","base_year":"2013"},"geometry":{"type":"Polygon","coordinates":[[[126.9738864128702,37.62949634786888],[126.977175406416,37.62859715400388],[126.98879865992384,37.6118927319756],[126.99348293358314,37.588565457216156],[127.02527254528003,37.57524616245249],[127.02547266349976,37.568943552237734],[126.96873633279075,37.56313604690827],[126.95565425846463,37.576080790881456],[126.9524752030572,37.60508692737045],[126.95427017006129,37.622033431339425],[126.9738864128702,37.62949634786888]]]}}
]}

# ***************
# 지도 시각화 도구 folium
# ***************
import folium

# 서울 시청 주변 지도보기 테스트

map_osm = folium.Map(location = [37.565674, 126.977859])
map_osm
map_osm.save(context+"map_osm.html")

# ***********
# 서울시 지도 시각화
# ************
import json
geo_path = context + "seoul_map.json"
geo_str = json.load(open(geo_path, encoding='UTF-8'))
map = folium.Map(location = [37.5502, 126.982],
                zoom_start=12, tiles='Stamen Toner')
map.save(context+"seoul_map.html")


